package com.heepay.tpds.enums;


/**
 * 
 *
 * 描    述：响应码及响应信息
 *
 * 创 建 者：   wangdong
 * 创建时间：2017年2月10日09:29:51
 * 创建描述：
 *
 * 修 改 者：
 * 修改时间：
 * 修改描述：
 *
 * 审 核 者：
 * 审核时间：
 * 审核描述：
 *
 */
public enum Code {
	/**
	 * 处理成功
	 */
	C0("P2P0000", "处理成功"),
	/**
	 * 受理成功
	 */
	S0("P2PS000", "受理成功"),
	/**
	 * 无符合条件记录
	 */
	C1("P2P0001", "无符合条件记录"),
	/**
	 * 原交易数据不存在
	 */
	C2("P2P0002", "原交易数据不存在"),
	/**
	 * 交易记录已存在
	 */
	C3("P2P0003", "交易记录已存在"),
	/**
	 * 数据库操作失败
	 */
	C4("P2P0004", "数据库操作失败"),
	/**
	 * 密码交易类计入流水失败
	 */
	C5("P2P0005", "密码交易类计入流水失败"),
	/**
	 * 信息模板代码无对应信息
	 */
	C6("P2P0006", "信息模板代码无对应信息"),
	/**
	 * 互金平台未纳入存管系统
	 */
	C101("P2P0101", "互金平台未纳入存管系统"),
	/**
	 * 版本号ID不符合规定
	 */
	C102("P2P0102", "版本号ID不符合规定"),
	/**
	 * 接入系统号不符合规定
	 */
	C103("P2P0103", "接入系统号不符合规定"),
	/**
	 * 交易码不符合规定
	 */
	C104("P2P0104", "交易码不符合规定"),
	/**
	 * 虚拟账户已存在
	 */
	C105("P2P0105", "虚拟账户已存在"),
	/**
	 * 交易密码不正确
	 */
	C106("P2P0106", "交易密码不正确"),
	/**
	 * 交易密码不可为空
	 */
	C107("P2P0107", "交易密码不可为空"),
	/**
	 * 业务流水重复
	 */
	C108("P2P0108", "业务流水重复"),
	/**
	 * 业务操作类型不可为空
	 */
	C109("P2P0109", "业务操作类型不可为空"),
	/**
	 * 业务操作类型不正确
	 */
	C110("P2P0110", "业务操作类型不正确"),
	/**
	 * 会员类型填写不正确
	 */
	C111("P2P0111", "会员类型填写不正确"),
	/**
	 * 会员类型不可为空
	 */
	C112("P2P0112", "会员类型不可为空"),
	/**
	 * 会员角色填写不正确
	 */
	C113("P2P0113", "会员角色填写不正确"),
	/**
	 * 会员角色不可为空
	 */
	C114("P2P0114", "会员角色不可为空"),
	/**
	 * 用户名不可为空
	 */
	C115("P2P0115", "用户名不可为空"),
	/**
	 * 证件类型填写不正确
	 */
	C116("P2P0116", "证件类型填写不正确"),
	/**
	 * 证件类型不可为空
	 */
	C117("P2P0117", "证件类型不可为空"),
	/**
	 * 证件号码填写不正确
	 */
	C118("P2P0118", "证件号码填写不正确"),
	/**
	 * 证件号码不可为空
	 */
	C119("P2P0119", "证件号码不可为空"),
	/**
	 * 身份证联网核查验证失败
	 */
	C120("P2P0120", "身份证联网核查验证失败"),
	/**
	 * 手机号不可为空
	 */
	C121("P2P0121", "手机号不可为空"),
	/**
	 * 手机号格式不正确
	 */
	C122("P2P0122", "手机号格式不正确"),
	/**
	 * 绑定类型填写错误
	 */
	C123("P2P0123", "绑定类型填写错误"),
	/**
	 * 绑定类型不可为空
	 */
	C124("P2P0124", "绑定类型不可为空"),
	/**
	 * 银行账号/卡号不可为空
	 */
	C125("P2P0125", "银行账号/卡号不可为空"),
	/**
	 * 客户名称不可为空
	 */
	C126("P2P0126", "客户名称不可为空"),
	/**
	 * 银行行号不可为空
	 */
	C127("P2P0127", "银行行号不可为空"),
	/**
	 * 交易密码格式不正确
	 */
	C128("P2P0128", "交易密码格式不正确"),
	/**
	 * 互金平台已停用
	 */
	C129("P2P0129", "互金平台已停用"),
	/**
	 * 互金平台正在维护中
	 */
	C130("P2P0130", "互金平台正在维护中"),
	/**
	 * 用户账户未开通
	 */
	C131("P2P0131", "用户账户未开通"),
	/**
	 * 用户账户存在，状态已注销
	 */
	C132("P2P0132", "用户账户存在，状态已注销"),
	/**
	 * 用户账户存在，联网核查中
	 */
	C133("P2P0133", "用户账户存在，联网核查中"),
	/**
	 * 证件号码已被使用
	 */
	C134("P2P0134", "证件号码已被使用"),
	/**
	 * 密码已经被设置
	 */
	C135("P2P0135", "密码已经被设置"),
	/**
	 * 用户ID非法
	 */
	C136("P2P0136", "用户ID非法"),
	/**
	 * 单个用户id对应多条数据
	 */
	C137("P2P0137", "单个用户id对应多条数据"),
	/**
	 * 用户账户存在，状态初始
	 */
	C138("P2P0138", "用户账户存在，状态初始"),
	/**
	 * 用户账户存在，已作废
	 */
	C139("P2P0139", "用户账户存在，已作废"),
	/**
	 * 该绑卡状态为已解绑
	 */
	C140("P2P0140", "该绑卡状态为已解绑"),
	/**
	 * 该绑卡未绑定
	 */
	C141("P2P0141", "该绑卡未绑定"),
	/**
	 * 银行卡预留手机号为空
	 */
	C142("P2P0142", "银行卡预留手机号为空"),
	/**
	 * 用户未留存密码
	 */
	C143("P2P0143", "用户未留存密码"),
	/**
	 * 用户绑定手机号不正确
	 */
	C144("P2P0144", "用户绑定手机号不正确"),
	/**
	 * 用户OCR信息未同步
	 */
	C145("P2P0145", "用户OCR信息未同步"),
	/**
	 * 用户OCR信息同步状态，同步中
	 */
	C146("P2P0146", "用户OCR信息同步状态，同步中"),
	/**
	 * 用户OCR信息同步状态，同步失败
	 */
	C147("P2P0147", "用户OCR信息同步状态，同步失败"),
	/**
	 * 用户OCR信息同步状态，同步异常
	 */
	C148("P2P0148", "用户OCR信息同步状态，同步异常"),
	/**
	 * 二类账户未开通
	 */
	C149("P2P0149", "二类账户未开通"),
	/**
	 * 二类账户状态，待激活
	 */
	C150("P2P0150", "二类账户状态，待激活"),
	/**
	 * 二类账户状态，冻结
	 */
	C151("P2P0151", "二类账户状态，冻结"),
	/**
	 * 二类账户状态，销户
	 */
	C152("P2P0152", "二类账户状态，销户"),
	/**
	 * 校验支付充值订单流水失败
	 */
	C153("P2P0153", "校验支付充值订单流水失败"),
	/**
	 * 发送验证码失败
	 */
	C154("P2P0154", "发送验证码失败"),
	/**
	 * 验证码错误
	 */
	C155("P2P0155", "验证码错误"),
	/**
	 * 用户状态非法
	 */
	C156("P2P0156", "用户状态非法"),
	/**
	 * 超过当天发送最大次数
	 */
	C157("P2P0157", "超过当天发送最大次数"),
	/**
	 * 验证码已经发送，请注意查收
	 */
	C158("P2P0158", "验证码已经发送，请注意查收"),
	/**
	 * 互金平台代码不能为空
	 */
	C159("P2P0159", "互金平台代码不能为空"),
	/**
	 * 互金平台名称不能为空
	 */
	C160("P2P0160", "互金平台名称不能为空"),
	/**
	 * 注册地不能为空
	 */
	C161("P2P0161", "注册地不能为空"),
	/**
	 * 注册资本金不能为空
	 */
	C162("P2P0162", "注册资本金不能为空"),
	/**
	 * 联系人姓名不能为空
	 */
	C163("P2P0163", "联系人姓名不能为空"),
	/**
	 * 联系人通讯电话不能为空
	 */
	C164("P2P0164", "联系人通讯电话不能为空"),
	/**
	 * 法人代表姓名不能为空
	 */
	C165("P2P0165", "法人代表姓名不能为空"),
	/**
	 * 法人代表身份证号不能为空
	 */
	C166("P2P0166", "法人代表身份证号不能为空"),
	/**
	 * 合同编号不能为空
	 */
	C167("P2P0167", "合同编号不能为空"),
	/**
	 * 互金平台信息已存在
	 */
	C168("P2P0168", "互金平台信息已存在"),
	/**
	 * 业务操作类型不正确
	 */
	C169("P2P0169", "登记身份信息已存在"),
	/**
	 * 业务操作类型不正确
	 */
	C170("P2P0170", "账号信息已存在"),
	/**
	 * 用户姓名错误
	 */
	C171("P2P0171", "用户姓名错误"),
	/**
	 * 用户绑定银行卡号错误
	 */
	C172("P2P0172", "用户绑定银行卡号错误"),
	/**
	 * 用户核心账户未开通
	 */
	C173("P2P0173", "用户核心账户未开通"),
	/**
	 * 该用户未绑定银行卡
	 */
	C174("P2P0174", "该用户未绑定银行卡"),
	/**
	 * 本地数据为登记异常信息后的数据，无需异常处理
	 */
	C175("P2P0175", "本地数据为登记异常信息后的数据，无需异常处理"),
	/**
	 * 身份信息验证失败
	 */
	C176("P2P0176", "身份信息验证失败"),
	/**
	 * 验证码失效，请重新获取
	 */
	C177("P2P0177", "验证码失效，请重新获取"),
	/**
	 * 密码已锁定，今日24:00解锁
	 */
	C178("P2P0178", "密码已锁定，今日24:00解锁"),
	/**
	 * 验证码失效，请重新获取
	 */
	C179("P2P0179", "验证码失效，请重新获取"),
	/**
	 * 用户信息不存在
	 */
	C180("P2P0180", "用户信息不存在"),
	/**
	 * 请获取验证码
	 */
	C181("P2P0181", "请获取验证码"),
	/**
	 * 用户绑卡信息不存在
	 */
	C182("P2P0182", "用户绑卡信息不存在"),
	/**
	 * 密码错误
	 */
	C183("P2P0183", "密码错误"),
	/**
	 * 账号不能一样请确认账号信息
	 */
	C184("P2P0184", "账号不能一样请确认账号信息"),
	/**
	 * 该资金账号信息已存在
	 */
	C185("P2P0185", "该资金账号信息已存在"),
	/**
	 * 互金平台信息不存在
	 */
	C186("P2P0186", "互金平台信息不存在"),
	/**
	 * 该账号信息不存在
	 */
	C187("P2P0187", "该账号信息不存在"),
	/**
	 * 该台账信息不存在
	 */
	C188("P2P0188", "该台账信息不存在"),
	/**
	 * 电子账户状态异常
	 */
	C189("P2P0189", "电子账户状态异常"),
	/**
	 * 处理状态错误
	 */
	C190("P2P0190", "处理状态错误"),
	/**
	 * 电子账户信息错误
	 */
	C191("P2P0191", "电子账户信息错误"),
	/**
	 * 客户OCR信息未同步
	 */
	C192("P2P0192", "客户OCR信息未同步"),
	/**
	 * 当前路径下未找到身份证影像文件
	 */
	C193("P2P0193", "当前路径下未找到身份证影像文件"),
	/**
	 * 客户账户信息不存在
	 */
	C194("P2P0194", "客户账户信息不存在"),
	/**
	 * 当前台账账户状态正常
	 */
	C195("P2P0195", "当前台账账户状态正常"),
	/**
	 * 当前台账账户状态冻结
	 */
	C196("P2P0196", "当前台账账户状态冻结"),
	/**
	 * 当前台账账户状态注销
	 */
	C197("P2P0197", "当前台账账户状态注销"),
	/**
	 * 委托协议不存在
	 */
	C198("P2P0198", "委托协议不存在"),
	/**
	 * 委托标识不能为空
	 */
	C199("P2P0199", "委托标识不能为空"),
	/**
	 * 台账账号为空
	 */
	C200("P2P0200", "台账账号为空"),
	/**
	 * 委托标识为未委托
	 */
	C201("P2P0201", "委托标识为未委托"),
	/**
	 * 委托标识为未委托
	 */
	C202("P2P0202", "标的编号为空"),
	/**
	 * 标的信息不存在
	 */
	C203("P2P0203", "标的信息不存在"),
	/**
	 * 标的金额未满标
	 */
	C204("P2P0204", "标的金额未满标"),
	/**
	 * 客户信息不存在
	 */
	C205("P2P0205", "客户信息不存在"),
	/**
	 * 账务调整失败
	 */
	C206("P2P0206", "账务调整失败"),
	/**
	 * 账务调整异常
	 */
	C207("P2P0207", "账务调整异常"),
	/**
	 * 服务场景未配置处理规则
	 */
	C208("P2P0208", "服务场景未配置处理规则"),
	/**
	 * 标的状态异常
	 */
	C209("P2P0209", "标的状态异常"),
	/**
	 * 委托协议号重复
	 */
	C210("P2P0210", "委托协议号重复"),
	/**
	 * 同类型委托协议已设置，不允许重复委托
	 */
	C211("P2P0211", "同类型委托协议已设置，不允许重复委托"),
	/**
	 * 账户可用余额不足
	 */
	C212("P2P0212", "账户可用余额不足"),
	/**
	 * 借方台账账号为空
	 */
	C213("P2P0213", "借方台账账号为空"),
	/**
	 * 贷方台账账号为空
	 */
	C214("P2P0214", "贷方台账账号为空"),
	/**
	 * 标的剩余可投金额小于交易金额
	 */
	C215("P2P0215", "标的剩余可投金额小于交易金额"),
	/**
	 * 交易金额小于起投金额
	 */
	C216("P2P0216", "交易金额小于起投金额"),
	/**
	 * 您已经设置了密码不能重复设置
	 */
	C217("P2P0217", "您已经设置了密码不能重复设置"),
	/**
	 * 没有进行代偿
	 */
	C218("P2P0218", "没有进行代偿"),
	/**
	 * 上送银行卡绑定异常
	 */
	C219("P2P0219", "上送银行卡绑定异常"),
	/**
	 * 用户ID重复不允许进行相关操作
	 */
	C300("P2P0300", "用户ID重复不允许进行相关操作"),
	/**
	 * 企业用户三证或者信用代码必须填写一种
	 */
	C301("P2P0301", "企业用户三证或者信用代码必须填写一种"),
	/**
	 * 互金平台状态异常
	 */
	C302("P2P0302", "互金平台状态异常"),
	/**
	 * 该银行卡已绑定
	 */
	C303("P2P0303", "该银行卡已绑定"),
	/**
	 * 必填字段不可为空
	 */
	C304("P2P0304", "必填字段不可为空"),
	/**
	 * 可提金额不足提现
	 */
	C305("P2P0305", "可提金额不足提现"),
	/**
	 * 充值、提现交易暂不支持委托操作
	 */
	C306("P2P0306", "充值、提现交易暂不支持委托操作"),
	/**
	 * 金额格式不正确
	 */
	C307("P2P0307", "金额格式不正确"),
	/**
	 * 系统处理异常
	 */
	C9999("P2P9999", "系统处理异常"),
	/**
	 * 通讯失败
	 */
	C9001("P2P9001", "通讯失败"),
	/**
	 * 通讯超时
	 */
	C9002("P2P9002", "通讯超时"),
	/**
	 * 业务流水重复，业务处理中
	 */
	C9003("P2P9003", "业务流水重复，业务处理中"),
	/**
	 * 业务流水重复，业务处理成功
	 */
	C9004("P2P9004", "业务流水重复，业务处理成功"),
	/**
	 * 业务流水重复，业务处理失败
	 */
	C9005("P2P9005", "业务流水重复，业务处理失败"),
	/**
	 * 业务流水重复，业务处理超时
	 */
	C9006("P2P9006", "业务流水重复，业务处理超时"),
	/**
	 * 文件写入失败
	 */
	C9007("P2P9007", "文件写入失败");
	
	
	String _value; 
	
	/**
	 * 存放内容
	 */
	String _content;
	
	/**
	 * 私有构造函数
	 * @param value 枚举值
	 * @param content 缓存内容
	 * @return 
	 */
	Code(String value, String content) {  
		this._value = value;  
		this._content = content;  
	}  
	
	/**
	 * 取得枚举对象值
	 * @return 枚举对象值
	 */
	public String getValue() {
		return this._value;
	}
	
	/**
	 * 取得内容
	 * @return 内容
	 */
	public String getContent() {
		return this._content;
	}

	/**
	 * 根据值取得内容
	 * 
	 * @return 内容
	 */

	public static Code getBean(String value) {
		for (Code e : Code.values()) {
			if (value.equals(e.getValue())) {
				return e;
			}
		}
		return null;
	}

	public static String labelOf(String val) {
		if (getBean(val) != null) {
			return getBean(val).getContent();
		}
		return null;
	}
}
