package com.heepay.tpds.enums;


/**
 * 
 *
 * 描    述：民族
 *
 * 创 建 者：   wangdong
 * 创建时间：2017年2月10日09:29:51
 * 创建描述：
 *
 * 修 改 者：
 * 修改时间：
 * 修改描述：
 *
 * 审 核 者：
 * 审核时间：
 * 审核描述：
 *
 */
public enum National {
	/**
	 * 汉族
	 */
	N10("10", "汉族"),
	/**
	 * 少数民族
	 */
	N20("20", "少数民族"),
	/**
	 * 蒙古族
	 */
	N2002("2002", "蒙古族"),
	/**
	 * 回族
	 */
	N2003("2003", "回族"),
	/**
	 * 维吾尔族
	 */
	N2004("2004", "维吾尔族"),
	/**
	 * 藏族
	 */
	N2005("2005", "藏族"),
	/**
	 * 苗族
	 */
	N2006("2006", "苗族"),
	/**
	 * 彝族
	 */
	N2007("2007", "彝族"),
	/**
	 * 壮族
	 */
	N2008("2008", "壮族"),
	/**
	 * 布依族
	 */
	N2009("2009", "布依族"),
	/**
	 * 朝鲜族
	 */
	N2010("2010", "朝鲜族"),
	/**
	 * 维吾尔族
	 */
	N2011("2011", "维吾尔族"),
	/**
	 * 侗族
	 */
	N2012("2012", "侗族"),
	/**
	 * 瑶族
	 */
	N2013("2013", "瑶族"),
	/**
	 * 白族
	 */
	N2014("2014", "白族"),
	/**
	 * 土家族
	 */
	N2015("2015", "土家族"),
	/**
	 * 哈尼族
	 */
	N2016("2016", "哈尼族"),
	/**
	 * 哈萨克族
	 */
	N2017("2017", "哈萨克族"),
	/**
	 * 傣族
	 */
	N2018("2018", "傣族"),
	/**
	 * 黎族
	 */
	N2019("2019", "黎族"),
	/**
	 * 僳僳族
	 */
	N2020("2020", "僳僳族"),
	/**
	 * 佤族
	 */
	N2021("2021", "佤族"),
	/**
	 * 畲族
	 */
	N2022("2022", "畲族"),
	/**
	 *高山族
	 */
	N2023("2023", "高山族"),
	/**
	 * 拉祜族
	 */
	N2024("2024", "拉祜族"),
	/**
	 * 水族
	 */
	N2025("2025", "水族"),
	/**
	 * 东乡族
	 */
	N2026("2026", "东乡族"),
	/**
	 * 纳西族
	 */
	N2027("2027", "纳西族"),
	/**
	 * 景颇族
	 */
	N2028("2028", "景颇族"),
	/**
	 * 柯尔克孜族
	 */
	N2029("2029", "柯尔克孜族"),
	/**
	 * 土族
	 */
	N2030("2030", "土族"),
	/**
	 * 达斡尔族
	 */
	N2031("2031", "达斡尔族"),
	/**
	 * 仫佬族
	 */
	N2032("2032", "仫佬族"),
	/**
	 * 羌族
	 */
	N2033("2033", "羌族"),
	/**
	 * 布朗族
	 */
	N2034("2034", "布朗族"),
	/**
	 * 撒拉族
	 */
	N2035("2035", "撒拉族"),
	/**
	 * 毛难族
	 */
	N2036("2036", "毛难族"),
	/**
	 * 仡佬族
	 */
	N2037("2037", "仡佬族"),
	/**
	 * 锡伯族
	 */
	N2038("2038", "锡伯族"),
	/**
	 * 阿昌族
	 */
	N2039("2039", "阿昌族"),
	/**
	 * 普米族
	 */
	N2040("2040", "普米族"),
	/**
	 * 塔吉克斯坦族
	 */
	N2041("2041", "塔吉克斯坦族"),
	/**
	 * 怒族
	 */
	N2042("2042", "怒族"),
	/**
	 * 乌孜别克族
	 */
	N2043("2043", "乌孜别克族"),
	/**
	 * 俄罗斯族
	 */
	N2044("2044", "俄罗斯族"),
	/**
	 * 鄂温克族
	 */
	N2045("2045", "鄂温克族"),
	/**
	 * 崩龙族
	 */
	N2046("2046", "崩龙族"),
	/**
	 * 保安族
	 */
	N2047("2047", "保安族"),
	/**
	 * 裕固族
	 */
	N2048("2048", "裕固族"),
	/**
	 * 京族
	 */
	N2049("2049", "京族"),
	/**
	 * 塔塔尔族
	 */
	N2050("2050", "塔塔尔族"),
	/**
	 * 独龙族
	 */
	N2051("2051", "独龙族"),
	/**
	 * 鄂伦春族
	 */
	N2052("2052", "鄂伦春族"),
	/**
	 * 赫哲族
	 */
	N2053("2053", "赫哲族"),
	/**
	 * 门巴族
	 */
	N2054("2054", "门巴族"),
	/**
	 * 珞巴族
	 */
	N2055("2055", "珞巴族"),
	/**
	 * 基诺族
	 */
	N2056("2056", "基诺族"),
	/**
	 * 其他
	 */
	N97("97", "其他"),
	/**
	 * 外国血统
	 */
	N98("98", "外国血统");
	
	
	String _value; 
	
	/**
	 * 存放内容
	 */
	String _content;
	
	/**
	 * 私有构造函数
	 * @param value 枚举值
	 * @param content 缓存内容
	 * @return 
	 */
	National(String value, String content) {  
		this._value = value;  
		this._content = content;  
	}  
	
	/**
	 * 取得枚举对象值
	 * @return 枚举对象值
	 */
	public String getValue() {
		return this._value;
	}
	
	/**
	 * 取得内容
	 * @return 内容
	 */
	public String getContent() {
		return this._content;
	}

	/**
	 * 根据值取得内容
	 * 
	 * @return 内容
	 */

	public static National getBean(String value) {
		for (National e : National.values()) {
			if (value.equals(e.getValue())) {
				return e;
			}
		}
		return null;
	}

	public static String labelOf(String val) {
		if (getBean(val) != null) {
			return getBean(val).getContent();
		}
		return null;
	}
}
